app/views/veiculos/index.html.erb

        <td><%= veiculo.empresa.razao %></td>
        <td><%= (0<VeiculoMotorista.where('veiculo_id=? and status=?',veiculo.id,1).count() ? VeiculoMotorista.where('veiculo_id=? and status=?',veiculo.id,1).take.motorista.nome : 'Sem Motorista') %></td>
---
SELECT COUNT(*) FROM "veiculo_motoristas" WHERE (veiculo_id=66 and status=1)