app/controllers/empresas_controller.rb

SELECT "empresas".* FROM "empresas"
---
  def index
    @empresas = Empresa.all