app/controllers/motoristas_controller.rb

SELECT "motoristas".* FROM "motoristas"
---
  def index
    @motoristas = Motorista.all

SELECT "motoristas"."nome" FROM "motoristas" WHERE (nome ilike '%n%')
---
  def autocomplete

    @motorista = Motorista.where("nome ilike ?","%#{params[:term]}%").select("nome")