app/controllers/ponto_paradas_controller.rb

  def index
    @ponto_paradas = PontoParada.all
---
SELECT "ponto_paradas".* FROM "ponto_paradas"