app/controllers/tipo_paradas_controller.rb

SELECT "tipo_paradas".* FROM "tipo_paradas"
---
  def index
    @tipo_paradas = TipoParada.all