app/controllers/tipo_eventos_controller.rb

SELECT "tipo_eventos".* FROM "tipo_eventos"
---
  def index
    @tipo_eventos = TipoEvento.all