app/controllers/veiculos_controller.rb

SELECT "veiculos".* FROM "veiculos"
---
  def index
    @veiculos = Veiculo.all